# StairTooManyConnectedBoundariesError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairTooManyConnectedBoundariesError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Stairs require no more than two boundaries (chains of one or more Boundary Lines).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairTooManyConnectedBoundariesError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairTooManyConnectedBoundariesError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairTooManyConnectedBoundariesError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace